###############################################################################
# Created by write_sdc
###############################################################################
current_design calculator_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 50.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RowIn[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RowIn[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RowIn[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RowIn[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {nRST}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ColOut[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ColOut[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ColOut[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ColOut[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {complete}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[11]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[12]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[13]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[14]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[15]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {display_output[9]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {input_state_FPGA[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {input_state_FPGA[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {input_state_FPGA[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {key_pressed}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {complete}]
set_load -pin_load 0.0334 [get_ports {key_pressed}]
set_load -pin_load 0.0334 [get_ports {ColOut[3]}]
set_load -pin_load 0.0334 [get_ports {ColOut[2]}]
set_load -pin_load 0.0334 [get_ports {ColOut[1]}]
set_load -pin_load 0.0334 [get_ports {ColOut[0]}]
set_load -pin_load 0.0334 [get_ports {display_output[15]}]
set_load -pin_load 0.0334 [get_ports {display_output[14]}]
set_load -pin_load 0.0334 [get_ports {display_output[13]}]
set_load -pin_load 0.0334 [get_ports {display_output[12]}]
set_load -pin_load 0.0334 [get_ports {display_output[11]}]
set_load -pin_load 0.0334 [get_ports {display_output[10]}]
set_load -pin_load 0.0334 [get_ports {display_output[9]}]
set_load -pin_load 0.0334 [get_ports {display_output[8]}]
set_load -pin_load 0.0334 [get_ports {display_output[7]}]
set_load -pin_load 0.0334 [get_ports {display_output[6]}]
set_load -pin_load 0.0334 [get_ports {display_output[5]}]
set_load -pin_load 0.0334 [get_ports {display_output[4]}]
set_load -pin_load 0.0334 [get_ports {display_output[3]}]
set_load -pin_load 0.0334 [get_ports {display_output[2]}]
set_load -pin_load 0.0334 [get_ports {display_output[1]}]
set_load -pin_load 0.0334 [get_ports {display_output[0]}]
set_load -pin_load 0.0334 [get_ports {input_state_FPGA[2]}]
set_load -pin_load 0.0334 [get_ports {input_state_FPGA[1]}]
set_load -pin_load 0.0334 [get_ports {input_state_FPGA[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {nRST}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {RowIn[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {RowIn[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {RowIn[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {RowIn[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
