###############################################################################
# Created by write_sdc
###############################################################################
current_design fpgacell
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_in[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_in[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_in[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_in[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {config_data_in}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {config_en}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {le_clk}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {le_en}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {le_nrst}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {nrst}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBeast_out[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {CBnorth_out[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBsouth_out[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[0]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[10]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[11]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[12]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[13]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[1]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[2]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[3]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[4]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[5]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[6]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[7]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[8]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {SBwest_out[9]}]
set_output_delay 20.0000 -clock [get_clocks {clk}] -add_delay [get_ports {config_data_out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {config_data_out}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[13]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[12]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[11]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[10]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[9]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[8]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[7]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[6]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[5]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[4]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[3]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[2]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[1]}]
set_load -pin_load 0.0334 [get_ports {CBeast_out[0]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[13]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[12]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[11]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[10]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[9]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[8]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[7]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[6]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[5]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[4]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[3]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[2]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[1]}]
set_load -pin_load 0.0334 [get_ports {CBnorth_out[0]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[13]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[12]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[11]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[10]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[9]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[8]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[7]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[6]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[5]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[4]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[3]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[2]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[1]}]
set_load -pin_load 0.0334 [get_ports {SBsouth_out[0]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[13]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[12]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[11]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[10]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[9]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[8]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[7]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[6]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[5]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[4]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[3]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[2]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[1]}]
set_load -pin_load 0.0334 [get_ports {SBwest_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_data_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {config_en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {le_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {le_en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {le_nrst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {nrst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBeast_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CBnorth_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBsouth_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SBwest_in[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
