###############################################################################
# Created by write_sdc
###############################################################################
current_design pwm_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name CLK -period 25.0000 [get_ports {CLK}]
set_clock_transition 0.1500 [get_clocks {CLK}]
set_clock_uncertainty 0.2500 CLK
set_propagated_clock [get_clocks {CLK}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[0]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[10]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[11]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[12]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[13]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[14]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[15]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[16]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[17]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[18]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[19]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[1]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[20]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[21]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[22]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[23]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[24]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[25]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[26]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[27]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[28]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[29]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[2]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[30]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[31]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[3]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[4]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[5]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[6]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[7]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[8]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {addr[9]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {nRST}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {ren}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {strobe[0]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {strobe[1]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {strobe[2]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {strobe[3]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[0]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[10]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[11]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[12]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[13]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[14]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[15]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[16]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[17]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[18]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[19]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[1]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[20]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[21]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[22]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[23]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[24]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[25]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[26]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[27]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[28]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[29]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[2]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[30]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[31]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[3]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[4]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[5]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[6]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[7]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[8]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wdata[9]}]
set_input_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {wen}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {error}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {pwm_out[0]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {pwm_out[1]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[0]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[10]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[11]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[12]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[13]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[14]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[15]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[16]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[17]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[18]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[19]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[1]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[20]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[21]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[22]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[23]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[24]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[25]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[26]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[27]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[28]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[29]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[2]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[30]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[31]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[3]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[4]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[5]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[6]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[7]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[8]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {rdata[9]}]
set_output_delay 5.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {request_stall}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {error}]
set_load -pin_load 0.0334 [get_ports {request_stall}]
set_load -pin_load 0.0334 [get_ports {pwm_out[1]}]
set_load -pin_load 0.0334 [get_ports {pwm_out[0]}]
set_load -pin_load 0.0334 [get_ports {rdata[31]}]
set_load -pin_load 0.0334 [get_ports {rdata[30]}]
set_load -pin_load 0.0334 [get_ports {rdata[29]}]
set_load -pin_load 0.0334 [get_ports {rdata[28]}]
set_load -pin_load 0.0334 [get_ports {rdata[27]}]
set_load -pin_load 0.0334 [get_ports {rdata[26]}]
set_load -pin_load 0.0334 [get_ports {rdata[25]}]
set_load -pin_load 0.0334 [get_ports {rdata[24]}]
set_load -pin_load 0.0334 [get_ports {rdata[23]}]
set_load -pin_load 0.0334 [get_ports {rdata[22]}]
set_load -pin_load 0.0334 [get_ports {rdata[21]}]
set_load -pin_load 0.0334 [get_ports {rdata[20]}]
set_load -pin_load 0.0334 [get_ports {rdata[19]}]
set_load -pin_load 0.0334 [get_ports {rdata[18]}]
set_load -pin_load 0.0334 [get_ports {rdata[17]}]
set_load -pin_load 0.0334 [get_ports {rdata[16]}]
set_load -pin_load 0.0334 [get_ports {rdata[15]}]
set_load -pin_load 0.0334 [get_ports {rdata[14]}]
set_load -pin_load 0.0334 [get_ports {rdata[13]}]
set_load -pin_load 0.0334 [get_ports {rdata[12]}]
set_load -pin_load 0.0334 [get_ports {rdata[11]}]
set_load -pin_load 0.0334 [get_ports {rdata[10]}]
set_load -pin_load 0.0334 [get_ports {rdata[9]}]
set_load -pin_load 0.0334 [get_ports {rdata[8]}]
set_load -pin_load 0.0334 [get_ports {rdata[7]}]
set_load -pin_load 0.0334 [get_ports {rdata[6]}]
set_load -pin_load 0.0334 [get_ports {rdata[5]}]
set_load -pin_load 0.0334 [get_ports {rdata[4]}]
set_load -pin_load 0.0334 [get_ports {rdata[3]}]
set_load -pin_load 0.0334 [get_ports {rdata[2]}]
set_load -pin_load 0.0334 [get_ports {rdata[1]}]
set_load -pin_load 0.0334 [get_ports {rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {nRST}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ren}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wen}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {strobe[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {strobe[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {strobe[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {strobe[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
