###############################################################################
# Created by write_sdc
###############################################################################
current_design sample_proj
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {enable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {nrst}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {prescaler[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {stop}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[32]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[33]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {out[33]}]
set_load -pin_load 0.0334 [get_ports {out[32]}]
set_load -pin_load 0.0334 [get_ports {out[31]}]
set_load -pin_load 0.0334 [get_ports {out[30]}]
set_load -pin_load 0.0334 [get_ports {out[29]}]
set_load -pin_load 0.0334 [get_ports {out[28]}]
set_load -pin_load 0.0334 [get_ports {out[27]}]
set_load -pin_load 0.0334 [get_ports {out[26]}]
set_load -pin_load 0.0334 [get_ports {out[25]}]
set_load -pin_load 0.0334 [get_ports {out[24]}]
set_load -pin_load 0.0334 [get_ports {out[23]}]
set_load -pin_load 0.0334 [get_ports {out[22]}]
set_load -pin_load 0.0334 [get_ports {out[21]}]
set_load -pin_load 0.0334 [get_ports {out[20]}]
set_load -pin_load 0.0334 [get_ports {out[19]}]
set_load -pin_load 0.0334 [get_ports {out[18]}]
set_load -pin_load 0.0334 [get_ports {out[17]}]
set_load -pin_load 0.0334 [get_ports {out[16]}]
set_load -pin_load 0.0334 [get_ports {out[15]}]
set_load -pin_load 0.0334 [get_ports {out[14]}]
set_load -pin_load 0.0334 [get_ports {out[13]}]
set_load -pin_load 0.0334 [get_ports {out[12]}]
set_load -pin_load 0.0334 [get_ports {out[11]}]
set_load -pin_load 0.0334 [get_ports {out[10]}]
set_load -pin_load 0.0334 [get_ports {out[9]}]
set_load -pin_load 0.0334 [get_ports {out[8]}]
set_load -pin_load 0.0334 [get_ports {out[7]}]
set_load -pin_load 0.0334 [get_ports {out[6]}]
set_load -pin_load 0.0334 [get_ports {out[5]}]
set_load -pin_load 0.0334 [get_ports {out[4]}]
set_load -pin_load 0.0334 [get_ports {out[3]}]
set_load -pin_load 0.0334 [get_ports {out[2]}]
set_load -pin_load 0.0334 [get_ports {out[1]}]
set_load -pin_load 0.0334 [get_ports {out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {nrst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {stop}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {prescaler[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
